tests/performance/plans/Grupo03_Plan_de_Pruebas_JMeter_CSV_Grupal.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Grupo03 - Plan de Pruebas de JMeter + CSV - Grupal" enabled="true"><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp></TestPlan><hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,aiquaa-sandbox-api.vercel.app)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,443)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,https)}</stringProp><stringProp name="HTTPSampler.implementation">HttpClient4</stringProp><stringProp name="HTTPSampler.connect_timeout">10000</stringProp><stringProp name="HTTPSampler.response_timeout">30000</stringProp></ConfigTestElement><hashTree/>
<CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true"><collectionProp name="CookieManager.cookies"/><boolProp name="CookieManager.clearEachIteration">false</boolProp></CookieManager><hashTree/>
<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="x-api-key" elementType="Header"><stringProp name="Header.name">x-api-key</stringProp><stringProp name="Header.value">${__P(apiKey,)}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="load closed workload" enabled="true"><stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(rampUp,30)}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(duration,180)}</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">${__P(loops,-1)}</stringProp></elementProp></ThreadGroup><hashTree><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true"><stringProp name="filename">${__P(csvFile,../data/Grupo03_Plan_de_Pruebas_JMeter_CSV_Grupal.csv)}</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">usuarioId,monto,fechaVencimiento</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/><Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Proveedores del Grupo 03" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="prov_1" elementType="Argument"><stringProp name="Argument.name">prov_1</stringProp><stringProp name="Argument.value">ANDE</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="prov_2" elementType="Argument"><stringProp name="Argument.name">prov_2</stringProp><stringProp name="Argument.value">ESSAP</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="prov_3" elementType="Argument"><stringProp name="Argument.name">prov_3</stringProp><stringProp name="Argument.value">COPACO</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="prov_4" elementType="Argument"><stringProp name="Argument.name">prov_4</stringProp><stringProp name="Argument.value">Tigo</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></Arguments><hashTree/><ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think time 500 ms" enabled="true"><stringProp name="ConstantTimer.delay">${__P(thinkTime,500)}</stringProp></ConstantTimer><hashTree/><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Listar facturas pendientes" enabled="true"><stringProp name="HTTPSampler.path">/api/v1/facturas?estado=pendiente</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="status">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extraer usuarioId aleatorio del GET" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">usuarioIdRuntime</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data[*].usuario_id</stringProp><stringProp name="JSONPostProcessor.match_numbers">0</stringProp><stringProp name="JSONPostProcessor.defaultValues">${usuarioId}</stringProp></JSONPostProcessor><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extraer facturaId aleatorio del GET" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">facturaIdRuntime</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data[*].id</stringProp><stringProp name="JSONPostProcessor.match_numbers">0</stringProp><stringProp name="JSONPostProcessor.defaultValues">0</stringProp></JSONPostProcessor><hashTree/><JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="El GET devuelve facturas pendientes" enabled="true"><stringProp name="JSON_PATH">$.data[0].estado</stringProp><stringProp name="EXPECTED_VALUE">pendiente</stringProp><boolProp name="JSONVALIDATION">true</boolProp><boolProp name="EXPECT_NULL">false</boolProp><boolProp name="INVERT">false</boolProp><boolProp name="ISREGEX">false</boolProp></JSONPathAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Crear factura" enabled="true"><stringProp name="HTTPSampler.path">/api/v1/facturas</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;usuarioId&quot;: ${usuarioIdRuntime}, &quot;proveedor&quot;: &quot;${__RandomFromMultipleVars(prov_1|prov_2|prov_3|prov_4,proveedorRnd)}&quot;, &quot;numeroFactura&quot;: &quot;${proveedorRnd}-PERF-${__threadNum}-${__counter(FALSE,)}-${__time(,)}&quot;, &quot;monto&quot;: ${monto}, &quot;fechaVencimiento&quot;: &quot;${fechaVencimiento}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 201" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="status">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
<ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><bytes>true</bytes><threadCounts>true</threadCounts><connectTime>true</connectTime><responseData>false</responseData></value></objProp><stringProp name="filename">${__P(jtlFile,~/../../../test-results/performance/R_Grupo03_Plan_de_Pruebas_JMeter_CSV_Grupal.jtl)}</stringProp></ResultCollector><hashTree/>
</hashTree></hashTree></hashTree></jmeterTestPlan>